Repository: IgnacioMunoz12/proyecto-App-WellQ
Catalog: lib/l10n/app_*.arb
Languages: es

# tagline
source: Your Health, Our Priority
es: Tu salud, nuestra prioridad

source: Sign Up
es: Crear cuenta

source: Sign In
es: Iniciar sesión

source: or continue with
es: o continúa con

# loginCanceled
source: Sign-in canceled.
es: Inicio de sesión cancelado.

# loginError
source: Error signing in: {error}
es: Error al iniciar sesión: {error}

# navHealth
source: Health
es: Salud

# navAnalytics
source: Analytics
es: Analítica

# navCalendar
source: Calendar
es: Calendario

# navCommit
source: Commit
es: Compromisos

# navSettings
source: Settings
es: Ajustes

# settingsTitle
source: Settings
es: Ajustes

# settingsTheme
source: Theme
es: Tema

# settingsThemeSubtitle
source: Light/Dark mode
es: Modo claro/oscuro

# settingsNotifications
source: Notifications
es: Notificaciones

# settingsNotificationsSubtitle
source: Configure alerts
es: Configurar alertas

# settingsLanguage
source: Language
es: Idioma

# settingsLanguageValueSystem
source: Follow system
es: Seguir sistema

# settingsLanguageValueEs
source: Spanish
es: Español

# settingsLanguageValueEn
source: English
es: Inglés

# devTools
source: Developer Tools
es: Herramientas de desarrollo

# dbViewer
source: Database Viewer
es: Visor de base de datos

# dbViewerSubtitle
source: View and manage local database
es: Ver y administrar la base de datos local

source: Insert Test Health Data
es: Insertar datos de prueba

# insertTestHealthDataSubtitle
source: Populate Health Connect with sample data
es: Llenar Health Connect con datos de ejemplo

source: Clear Test Data
es: Borrar datos de prueba

# clearTestDataSubtitle
source: Remove all test health data
es: Eliminar todos los datos de prueba

source: Force Save Metrics
es: Forzar guardado de métricas

# forceSaveMetricsSubtitle
source: Save current health data to database
es: Guardar datos de salud actuales en la base

# confirmClearTitle
source: Clear Test Data?
es: ¿Borrar datos de prueba?

# confirmClearBody
source: This will delete all test health data from Health Connect. Your habits and other app data will remain safe.
es: Esto eliminará todos los datos de prueba de Health Connect. Tus hábitos y otros datos de la app se mantendrán.

source: Cancel
es: Cancelar

source: Clear
es: Borrar

source: Inserting test data...
es: Insertando datos de prueba...

# insertOk
source: Test data inserted successfully!
es: ¡Datos de prueba insertados correctamente!

# clearOk
source: Test data cleared
es: Datos de prueba eliminados

# checkLogs
source: Check logs for details
es: Revisa los logs para más detalles

# dailyCommitmentsTitle
source: Daily Commitments
es: Compromisos diarios

source: Today's Progress
es: Progreso de hoy

# commitmentsCompleted
source: {done}/{total} commitments completed
es: {done}/{total} compromisos completados

source: Start
es: Iniciar

source: Refresh Data
es: Actualizar datos

# calendarTitle
source: Calendar
es: Calendario

source: Today's Events
es: Eventos de hoy

# noEventsToday
source: No events for today
es: No hay eventos para hoy

source: Reminders
es: Recordatorios

# aiSessionTitle
source: AI-Optimized Session
es: Sesión optimizada por IA

# aiSessionSubtitle
source: Mobility focus Â· {minutes} min
es: Enfoque movilidad · {minutes} min

# basedOnRecovery
source: Based on your recovery data
es: Según tus datos de recuperación

source: Health Vitals
es: Signos de salud

# vitalsTab
source: Vitals
es: Signos

# metricsTab
source: Metrics
es: Métricas

# stepsLabel
source: Steps
es: Pasos

# sleepLabel
source: Sleep
es: Sueño

source: Language updated
es: Idioma actualizado

# createAccountHeader
source: CREATE ACCOUNT
es: CREAR CUENTA

# joinCommunity
source: Join our health community
es: Únete a nuestra comunidad de salud

# usernameLabel
source: Username
es: Usuario

# usernameHint
source: Enter your username
es: Ingresa tu usuario

# emailHint
source: Enter your email
es: Ingresa tu email

# passwordLabel
source: Password
es: Contraseña

# passwordHint
source: Enter your password
es: Ingresa tu contraseña

# confirmPasswordLabel
source: Confirm Password
es: Confirmar contraseña

# confirmPasswordHint
source: Confirm your password
es: Confirma tu contraseña

# iAgreeTo
source: I agree to the
es: Acepto los

# termsAndConditions
source: Terms & Conditions
es: Términos y Condiciones

source: and
es: y

source: Privacy Policy
es: Política de Privacidad

source: or sign up with
es: o regístrate con

# alreadyHaveAccount
source: Already have an account?
es: ¿Ya tienes una cuenta?

# createAccountCta
source: Create Account
es: Crear cuenta

# accountCreatedOk
source: Account created successfully!
es: ¡Cuenta creada correctamente!

# registrationFailed
source: Registration failed: {error}
es: Registro fallido: {error}

# pleaseEnterUsername
source: Please enter your username
es: Ingresa tu nombre de usuario

# pleaseEnterValidEmail
source: Please enter a valid email
es: Ingresa un email válido

# passwordMinChars
source: Password must be at least {min} characters
es: La contraseña debe tener al menos {min} caracteres

source: Passwords don't match
es: Las contraseñas no coinciden

# pleaseAcceptTerms
source: Please accept Terms & Conditions
es: Acepta los Términos y Condiciones

# emailAlreadyRegistered
source: This email is already registered
es: Este email ya está registrado

# passwordTooWeak
source: Password is too weak
es: La contraseña es demasiado débil

source: Invalid email format
es: Formato de email inválido

# registrationGenericError
source: Registration failed. Please try again.
es: No se pudo completar el registro. Intenta nuevamente.

# enterEmailAndPassword
source: Please enter email and password
es: Ingresa email y contraseña

# wrongCredentials
source: Incorrect email or password
es: Email o contraseña incorrectos

# userDisabled
source: This account has been disabled
es: Esta cuenta ha sido deshabilitada

# tooManyRequests
source: Too many attempts. Try again later
es: Demasiados intentos. Intenta más tarde

# networkError
source: Connection error. Check your internet
es: Error de conexión. Verifica tu internet

# signInGenericError
source: Failed to sign in. Try again
es: Error al iniciar sesión. Intenta nuevamente

# unexpectedError
source: Unexpected error. Try again
es: Error inesperado. Intenta nuevamente

# signInButton
source: Sign In
es: Iniciar sesión

source: Health Metrics
es: Métricas de salud

source: Recovery Optimization
es: Optimización de recuperación

# recoveryLabel
source: Recovery
es: Recuperación

# heartRateLabel
source: Heart Rate
es: Frecuencia cardiaca

# currentLabel
source: Current
es: Actual

source: No data
es: Sin datos

# exerciseLabel
source: Exercise
es: Ejercicio

# stressLabel
source: Stress
es: Estrés

# statusLow
source: Low
es: Bajo

# statusModerate
source: Moderate
es: Moderado

# statusHigh
source: High
es: Alto

# statusOptimal
source: Optimal
es: Óptimo

# statusLight
source: Light
es: Ligero

# weightLabel
source: Weight
es: Peso

source: Using mock data
es: Usando datos simulados

# updatedAgo
source: Updated {time}
es: Actualizado {time}

# timeJustNow
source: just now
es: justo ahora

# timeMinutes
source: {m}m
es: {m} min

# recoveryBreadcrumb
source: {program} • Day {day}
es: {program} • Día {day}

# weeklyChange
source: {percent} this week
es: {percent} esta semana

source: Connect Health
es: Conectar Health

# boneLabel
source: Bone
es: Hueso

# densityLabel
source: Density
es: Densidad

# muscleLabel
source: Muscle
es: Músculo

# strengthLabel
source: Strength
es: Fuerza

# jointLabel
source: Joint
es: Articulación

# mobilityLabel
source: Mobility
es: Movilidad

# vo2maxLabel
source: VO2 Max
es: VO2 Máx

source: Start streak
es: Comenzar racha

# todaysHabitsTitle
source: Today's Habits
es: Hábitos de hoy

source: Pending
es: Pendiente

# habitPending
source: Pending
es: Pendiente

# habitDone
source: Completed
es: Completado

# minutes
source: {count} minutes
es: {count} minutos

# streakActiveDays
source: {days}-day streak
es: Racha: {days} días

# habitMorningStretches
source: Morning Stretches
es: Estiramientos matutinos

# habitPhysicalTherapy
source: Physical Therapy
es: Fisioterapia

# habitEveningWalk
source: Evening Walk
es: Caminata vespertina

# habitMeditation
source: Meditation
es: Meditación

source: Pause
es: Pausar

source: Skip to Next
es: Saltar al siguiente

source: Complete Now
es: Completar ahora

source: Complete Early
es: Completar antes

# completeAction
source: Complete
es: Completar

source: No habits yet
es: Aún no tienes hábitos

# addFirstHabit
source: Add your first habit to get started
es: Añade tu primer hábito para comenzar

# stepOfTotal
source: Step {step} of {total}
es: Paso {step} de {total}

# habitSnackStart
source: Great start! Begin your streak!
es: ¡Gran inicio! ¡Comienza tu racha!

# habitSnackNewRecord
source: New record! {days}-day streak!
es: ¡Nuevo récord! ¡{days} días de racha!

# habitSnackAmazing
source: Amazing! {days}-day streak!
es: ¡Asombroso! ¡{days} días de racha!

# habitSnackCompleted
source: Habit completed! {days}-day streak!
es: ¡Hábito completado! ¡{days} días de racha!

# hiUser
source: Hi, {name}
es: Hola, {name}

# myTrainingOverline
source: My training
es: Mi entrenamiento

# progressLabel
source: Progress
es: Progreso

# sessionsXofY
source: Sessions: {done}/{total}
es: Sesiones: {done}/{total}

# planSessions
source: {count}-session plan
es: Plan de {count} sesiones

# goalPerWeek
source: Goal: {count}/week
es: Meta: {count}/sem

# nextWorkoutOverline
source: Next workout
es: Próximo entrenamiento

source: Open my workout
es: Abrir mi rutina

# todayWorkoutSubtitle
source: Today {time} • Category {category}
es: Hoy {time} • Categoría {category}

# seeOtherWorkouts
source: See other workout options
es: Ver otras opciones de entrenamiento

# yourRoutineOverline
source: Your routine
es: Tu rutina

source: Consecutive training weeks
es: Semanas consecutivas

source: Training commitment
es: Compromiso de entrenamiento

# treatmentCategoriesTitle
source: Treatment Categories
es: Categorías de tratamiento

# recoveryProgramTitle
source: Recovery Program
es: Programa de recuperación

# therapeuticExercisesRehab
source: Therapeutic exercises for rehabilitation
es: Ejercicios terapéuticos para rehabilitación

# recoveryExercisesCount
source: {count} recovery exercises
es: {count} ejercicios de recuperación

# injuryLigamentTear
source: Ligament Tear
es: Desgarro de ligamento

# injuryRotatorCuff
source: Rotator Cuff Issues
es: Manguito rotador

# categoryTitle
source: Category {letter}
es: Categoría {letter}

source: Therapeutic recovery exercises
es: Ejercicios terapéuticos de recuperación

source: Tap for instructions
es: Toca para ver instrucciones

source: Complete session
es: Completar sesión

# sessionSaved
source: Session completed and saved
es: Sesión completada y guardada

# exerciseInstructionsTitle
source: Exercise Instructions
es: Instrucciones del ejercicio

source: Step-by-step instructions
es: Instrucciones paso a paso

source: Safety tips
es: Consejos de seguridad

source: Back to exercise list
es: Volver a la lista de ejercicios

# todaysCheckInTitle
source: Today's check-in
es: Chequeo de hoy

# checkInSubtitle
source: Tell us how you feel after the session.
es: Cuéntanos cómo te sientes tras la sesión.

source: Pain level
es: Nivel de dolor

source: Stiffness
es: Rigidez

source: How do you feel today?
es: ¿Cómo te sientes hoy?

# anyObservationsHint
source: Any observations?
es: ¿Alguna observación?

source: Send
es: Enviar

# statusImproving
source: Improving
es: Mejorando

# statusStable
source: Stable
es: Estable

# statusStiff
source: Stiff
es: Rígido

# calendarSubtitle
source: Schedule and track your recovery activities
es: Programa y lleva el control de tus actividades de recuperación

# reminderTakeMedication
source: Take medication
es: Tomar medicamento

# reminderIceTherapy
source: Ice therapy session
es: Sesión de terapia con hielo

# reminderLogPainLevels
source: Log pain levels
es: Registrar niveles de dolor

# dueIn
source: Due in {time}
es: Vence en {time}

# healthPermsTitle
source: Health Permissions Required
es: Se requieren permisos de salud

# healthPermsBody
source: Please grant access to Health Connect to track your daily commitments and health metrics
es: Concede acceso a Health Connect para registrar tus compromisos diarios y métricas de salud

source: Grant Permissions
es: Conceder permisos

source: Go to Dashboard
es: Ir al panel

# commitWalkSteps
source: Walk {count} steps
es: Camina {count} pasos

# commitDrinkWater
source: Drink {liters} liters of water
es: Beber {liters} litros de agua

# commitSleepHours
source: Sleep {hours} hours
es: Duerme {hours} horas

# commitConsumeCalories
source: Consume {kcals} calories
es: Consume {kcals} calorías

# unitSteps
source: steps
es: pasos

# unitHours
source: hours
es: horas

source: Day Streak
es: Racha de días

# longestStreak
source: Your longest streak: {days} days
es: Tu racha más larga: {days} días

# commitDrinkWaterLiters
source: Drink {liters} liters of water
es: Bebe {liters} litros de agua

# unitStepsShort
source: steps
es: pasos
